testdata/IN_2023_02/Roundtrip/produkt/arbeitskraft/sbu/20121109_sbu_vorgabe_beitrag_2023_02b.xml_request_2023_02b.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <tarif:getQuote xmlns:allg="http://www.bipro.net/namespace/allgemein" xmlns:basis="http://www.bipro.net/namespace/basis" xmlns:dt="http://www.bipro.net/namespace/datentypen" xmlns:gevo="http://www.bipro.net/namespace/gevo" xmlns:nachr="http://www.bipro.net/namespace/nachrichten" xmlns:partner="http://www.bipro.net/namespace/partner" xmlns:pm="http://www.bipro.net/namespace/produktmodell" xmlns:pm-leben="http://www.bipro.net/namespace/versicherung/produktmodell/leben" xmlns:tarif="http://www.bipro.net/namespace/versicherung/tarifierung" xmlns:vbl="urn:de:vb:bipro:taa:leben:1.12" xmlns:vs-pm="http://www.bipro.net/namespace/versicherung/produktmodell" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
         
      <tarif:Request>
              
        <nachr:BiPROVersion>2.4.6.1.12</nachr:BiPROVersion>
        <nachr:ConsumerID>WS DEV TEAM</nachr:ConsumerID>
              
        <tarif:Tarifierung>
                   
          <gevo:Vermittler>
                        
            <allg:Vermittlernummer>111/222</allg:Vermittlernummer>
                     
          </gevo:Vermittler>
                   
          <tarif:Partner xsi:type="partner:CT_Person">
                        
            <partner:PartnerID>1</partner:PartnerID>
                        
            <partner:Geburtsdatum>1992-11-01</partner:Geburtsdatum>
                        
            <partner:Geschlecht>1</partner:Geschlecht>
                        
            <partner:Berufstaetigkeit>
                             
              <basis:Erweiterung xsi:type="vbl:CT_BerufstaetigkeitErweiterung">
                                 
                <vbl:Personalverantwortung>true</vbl:Personalverantwortung>
                               
              </basis:Erweiterung>
                             
              <partner:Beruf>Fachwirt</partner:Beruf>
                             
              <partner:StellungImBeruf xsi:type="dt:STE_StellungImBerufBasis">01</partner:StellungImBeruf>
               
               
              <partner:KoerperlichTaetig>5</partner:KoerperlichTaetig>
                             
              <partner:NichtKoerperlichTaetig>80</partner:NichtKoerperlichTaetig>
                          
            </partner:Berufstaetigkeit>
                        
            <partner:Ausbildung>
                            
              <partner:ArtID xsi:type="dt:STE_AusbildungsartBasis">BeruflicheAusbildung</partner:ArtID>
                          
            </partner:Ausbildung>
                     
          </tarif:Partner>
                   
          <tarif:Versicherungsnehmer>
                        
            <partner:PartnerID>1</partner:PartnerID>
                     
          </tarif:Versicherungsnehmer>
                   
          <tarif:Verkaufsprodukt>
                        
            <pm:Produkt xsi:type="pm-leben:CT_Produkt">
                             
              <basis:Erweiterung xsi:type="vbl:CT_ProduktErweiterung">
                                  
                <vbl:Tarifgruppe>Normal</vbl:Tarifgruppe>
                               
              </basis:Erweiterung>
                             
              <pm:GewuenschteZahlungsweise>8</pm:GewuenschteZahlungsweise>
                             
              <pm:Versicherungsdauer>
                                 
                <allg:Beginn>2023-03-01T12:00</allg:Beginn>
                               
              </pm:Versicherungsdauer>
                             
              <pm:Kennung>SBU</pm:Kennung>
                             
              <pm:Elementarprodukt xsi:type="pm-leben:CT_ArbeitskraftAbsicherung">
                                 
                <pm:Beitrag>
                                     
                  <pm:ArtID xsi:type="dt:STE_BeitragBasis">01</pm:ArtID>
                                     
                  <pm:Betrag>
                                         
                    <allg:Betrag>200</allg:Betrag>
                                         
                    <allg:Waehrung>EUR</allg:Waehrung>
                                       
                  </pm:Betrag>
                                     
                  <pm:Zahlungsweise>8</pm:Zahlungsweise>
                                   
                </pm:Beitrag>
                                  
                <pm:Versicherungsdauer>
                                       
                  <allg:AnzahlJahre>20</allg:AnzahlJahre>
                                       
                  <allg:AnzahlMonate>0</allg:AnzahlMonate>
                                    
                </pm:Versicherungsdauer>
                                  
                <pm-leben:IstHauptversicherung>true</pm-leben:IstHauptversicherung>
                                  
                <pm-leben:UeberschussverwendungVorLeistung xsi:type="dt:STE_UeberschussverwendungBasis">12</pm-leben:UeberschussverwendungVorLeistung>
                                  
                <pm-leben:VersichertePerson>
                                       
                  <partner:PartnerID>1</partner:PartnerID>
                                    
                </pm-leben:VersichertePerson>
                                  
                <pm-leben:Art xsi:type="dt:STE_UnfaehigkeitsZusatzArtBasis">Rente</pm-leben:Art>
                                  
                <pm-leben:Auspraegung xsi:type="dt:STE_UnfaehigkeitsZusatzAuspraegungBasis">BU</pm-leben:Auspraegung>
                               
              </pm:Elementarprodukt>
                             
              <pm-leben:VorgabeBerechnung>
                                  
                <pm-leben:ArtID xsi:type="dt:STE_VorgabeBerechnungBasis">Bruttobeitrag</pm-leben:ArtID>
                                  
                <pm-leben:Kontext xsi:type="dt:STE_VorgabeBerechnungKontextBasis">ArbeitskraftAbsicherung</pm-leben:Kontext>
                               
              </pm-leben:VorgabeBerechnung>
                          
            </pm:Produkt>
                     
          </tarif:Verkaufsprodukt>
                
        </tarif:Tarifierung>
           
      </tarif:Request>
      
    </tarif:getQuote>
  </soapenv:Body>
</soapenv:Envelope>
